# Задача з уроку:
# Користувач дає вам список (тобто в програмі у вас буде змінна зі списком оцінок), наприклад:
# class_marks = [11, 10, 11, 10, 8]
#
# Вам потрібно вирахувати середню оцінку в групі.
#

class_marks = [11, 10, 11, 10, 8]
n = len(class_marks)
average = (sum(class_marks))/ n
print(average)

# Задача 2:
# Попросіть користувача ввести рядок з 4 словами, збережіть це у список, видаліть два останні елементи. І додайте в кінець один елемент з вашим іменем.
#
# Задача 3:
# Попросіть користувача ввести рядок зі словами, підрахуйте кількість цих слів і виведіть користувачу, скільки слів він ввів.

# Задача 1
# Написати цикл for, який обраховує суму всіх чисел у списку numbers = [1, 2, 3, 4, 5].
#
# Задача 2
# Використовуючи цикл for, напишіть код, який ітерує по списку numbers = [-2, -1, 0, 1, 2] і виводить тільки позитивні числа.
#
# Задача 3
# Використовуючи цикл for, створіть новий список, що містить квадрати всіх чисел у вихідному списку numbers = [1, 2, 3, 4, 5].
