# Задача 1
#
# Напишіть программу "Касир в кінотеватрі", яка попросить користувача ввести свій вік (можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).
#
# якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
#
# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
#
# якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"

# age = int(input("Введіть свій вік: "))
# if age < 7:
#     print("Де твої батьки?")
# elif age < 16:
#     print("Це фільм для дорослих!")
# elif 16 <= age < 65:
#     print("Вітаємо в кінотеатрі")
# else:
#     print('Покажіть пенсійне посвідчення!')

# Варіант №2
# age = int(input("Введіть свій вік: "))
# if age < 7:
#     print("Де твої батьки?")
# elif age < 16:
#     print("Це фільм для дорослих!")
# elif 16 <= age and age < 65:
#     print("Вітаємо в кінотеатрі")
# else:
#     print('Покажіть пенсійне посвідчення!')


# Задача 2
# Текстова. в чому різниця між is та ==?
# Різниця в тому, що оператор is порівнює по айді, а оператор == по значенню.
# var_1 = 999
# var_2 = 999
#
# if var_1 == var_2:
#     print("var_1 рівний var_2 ")
# else:
#     print("var_1 не рівний var_2")
# для точного результату (для того, щоб id відрізнялися, потрібно вводити у Terminal aбо Python Console)
# var_1 =  999
# var_2 =  999
#
# if var_1 is var_2:
#     print("var_1 рівний var_2 ")
# else:
#     print("var_1 не рівний var_2")
# print(id(var_1), id(var_2))



# Задача 3
#
# Напишіть програму яка в користувача запитує два числа(можуть бути числа типу інт,
# а можуть бути в стр). Потім запитує це стр чи інт і в залежності від відповіді конкатенує їх або додає і повертає результат перемножений на три.
# якщо після конкатенації отримали 10 то перемноживши на 3 отримаємо 30.

# number_1 = input("Введіть перше число: ")
# number_2 = input("Введіть друге число: ")
# number_3 = input("Введені числа str чи int: ")


# Варіант №1
# if number_3 == "str":
#     result_1 = number_1 + number_2
#     print(result_1 * 3)
# elif number_3 == "int":
#     result_2 = int(number_1) + int(number_2)
#     print(result_2 * 3)
#
# Варіант №2

# if number_3 == "str":
#     result_1 = number_1 + number_2
#     print(int(result_1) * 3)  # якщо після конкатенації отримали 10 то перемноживши на 3 отримаємо 30
# elif number_3 == "int":
#     result_2 = int(number_1) + int(number_2)
#     print(result_2 * 3)





