# Додаткове завдання
# Задача 1:
# Попросіть користувача ввести рядок і перевірте, чи є заданий рядок
# порожнім, конвертувавши його в булеве значення.

# line = input("Введіть рядок: ")
# new_line = bool(line)
#
# if new_line == False:
#     print("Рядок порожній", new_line)
# else:
#     print("рядок не порожній: ", line, new_line)


#
# Задача 2:
# Попросіть користувача ввести три числа, які в сумі дають 100, і перевірте це за допомогою assert.
# Якщо користувач ввів неправильно, виведіть йому помилку з написом на ваш розсуд.

# num_1 = int(input("Введіть число 1: "))
# num_2 = int(input("Введіть число 2: "))
# num_3 = int(input("Введіть число 3: "))
# sum = num_3 + num_2 + num_1
#
# assert sum == 100, "Сума введених чисел не дорівнює 100"
#
# print("Вітаємо. Ви ввели три числа, сума яких = 100 ")


# Задача 3:
# Створіть програму, яка запитує у користувача його вік. Якщо вік користувача менше
# 18 років, програма повинна вивести "Ви ще надто молоді", якщо вік рівний або більше 18 років, то повинна вивести "Ласкаво просимо!".

# age = int(input("Введіть Ваш вік: "))
#
# if age < 18:
#     print("Ви ще надто молоді")
# elif age >= 18:
#     print("Ласкаво просимо!")
#
# Задача 4:
# Напишіть програму, яка порівнює дві змінні: temperature_outside та temperature_comfort.
# Якщо temperature_outside вище temperature_comfort, виведіть "Увімкніть кондиціонер". Якщо нижче, виведіть "Можливо, вам буде комфортно без кондиціонера".

# temperature_outside = int(input("temperature_outside: "))
# temperature_comfort = int(input("temperature_comfort: "))
#
# if temperature_outside > temperature_comfort:
#     print("Увімкніть кондиціонер")
# else:
#     print("Можливо, вам буде комфортно без кондиціонера")
#

# Задача 5:
# напишіть студентські тести по математиці де ви даєте приклад і користувач вводе відповідь,
# а ви йому відповідаєте вірно він вирішив задачу чи ні. Зробіть 3-5 прикладів.

# test_1 = int(input("2 + 2 = "))
# assert test_1 == 4, "Ви ввели неправильну відповідь"
# print("Так, це правильна відповідь")
#
# test_2 = int(input("5 * 3 = "))
# assert test_2 == 15, "Ви ввели неправильну відповідь"
# print("Так, це правильна відповідь")
#
# test_3 = int(input("6 / 2 = "))
# assert test_3 == 3, "Ви ввели неправильну відповідь"
# print("Так, це правильна відповідь")
#
# test_4 = int(input("7 - 2 = "))
# assert test_4 == 5, "Ви ввели неправильну відповідь"
# print("Так, це правильна відповідь")
#
# test_5 = int(input("1 + 2 * 6 = "))
# assert test_5 == 13, "Ви ввели неправильну відповідь"
# print("Так, це правильна відповідь")
#
# print("Вітаємо, ви успішно пройшли тест")

# Варіант №2
# test_1 = int(input("2 + 2 = "))
# if test_1 == 4:
#     print("Так, це правильна відповідь")
# else:
#     print("Ви ввели неправильну відповідь")
#
# test_2 = int(input("5 * 3 = "))
# if test_2 == 15:
#     print("Так, це правильна відповідь")
# else:
#     print("Ви ввели неправильну відповідь")
#
# test_3 = int(input("6 / 2 = "))
# if test_3 == 3:
#     print("Так, це правильна відповідь")
# else:
#     print("Ви ввели неправильну відповідь")
#
# test_4 = int(input("7 - 2 = "))
# if test_4 == 5:
#     print("Так, це правильна відповідь")
# else:
#     print("Ви ввели неправильну відповідь")
#
# test_5 = int(input("1 + 2 * 6 = "))
# if test_5 == 13:
#     print("Так, це правильна відповідь")
# else:
#     print("Ви ввели неправильну відповідь")




#  Задача 6: Так як я у відео міняв значення за допомогою віднімання та додавання,
# зробіть це ж саме за допомогою множення. Там дуже простий алгоритм вирішення.
# Спробуйте в ньому розібратись

# var_1 = 2
# var_2 = 4
# print(var_1, var_2)
#
# # var_2 = var_2 + var_1
# # var_1 = var_2 - var_1
# # var_2 = var_2 - var_1
#
# var_2 = var_2 * var_1
# var_1 = var_2 // var_1
# var_2 = var_2 // var_1
#
# print(var_1, var_2)

#  Задача 7: Напишіть програму яка буде приймати квадратне рівняння і розвязувати його.
# Памятайте що там є декілька випадків по іксам. Завдання не складне але обьємне.
# Подумайте як прийняти дані від користувача, ну і над рештою).

# a = int(input("а = "))
# b = int(input("b = "))
# c = int(input("c = "))
# #equation = a * (x**2) + b * x + c
#
# discriminator = (b**2) - 4 * a * c
# print("Дискримінант = ", discriminator)
# if discriminator < 0:
#     print("Рівняння не має дійсних коренів")
# elif discriminator == 0:
#     x_1 = (-b - (discriminator ** 0.5)) / 2 * a
#     print("Рівняння має один дійсний корінь", x_1)
# else:
#     x_1 = (-b - (discriminator**0.5)) / 2 * a
#     x_2 = (-b + (discriminator**0.5)) / 2 * a
#     print(x_1,x_2)
#     if x_1 < x_2:
#         print("Рівняння має два корені ", x_1,  x_2)
#         print("Рівняння має два корені ", x_2, x_1)