# Задача 1
#
# Напишіть программу "Касир в кінотеватрі", яка попросить користувача ввести свій вік (можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).
#
# якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
#
# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
#
# якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"

# age = int(input("Введіть свій вік: "))
# if age < 7:
#     print("Де твої батьки?")
# elif age < 16:
#     print("Це фільм для дорослих!")
# elif 16 < age < 65:
#     print("Вітаємо в кінотеатрі")
# else:
#     print('Покажіть пенсійне посвідчення!')



# Задача 2
# Текстова. в чому різниця між is та ==?
# Різниця в тому, що оператор is порівнює по айді, а оператор == по значенню.

# Задача 3
#
# Напишіть програму яка в користувача запитує два числа(можуть бути числа типу інт,
# а можуть бути в стр). Потім запитує це стр чи інт і в залежності від відповіді конкатенує їх або додає і повертає результат перемножений на три.
# якщо після конкатенації отримали 10 то перемноживши на 3 отримаємо 30.

# number_1 = int(input("Введіть перше число: "))
# number_2 = int(input("Введіть друге число: "))

# if (type(number_1) == str):
#     if (type(number_2) == str):
#         result = number_1 + number_2
#         print(result * 3)
# elif (type(number_1) == int):
#     if (type(number_2) == int):
#         result_1 = number_1 + number_2
#         print(result_1 * 3)

# Варіант 2
# if (type(number_1) == str):
#     if (type(number_2) == str):
#         result = number_1 + number_2
#         print(result * 3)
# else:
#     result_1 = number_1 + number_2
#     print(result_1 * 3)



# Додаткове завдання хто хоче поглибити знання (воно не оцінюється).
# 1) Так як я у відео міняв значення за допомогою віднімання та додавання,
# зробіть це ж саме за допомогою множення. Там дуже простий алгоритм вирішення.
# Спробуйте в ньому розібратись

# var_1 = 2
# var_2 = 4
# print(var_1, var_2)
#
# # var_2 = var_2 + var_1
# # var_1 = var_2 - var_1
# # var_2 = var_2 - var_1
#
# var_2 = var_2 * var_1
# var_1 = var_2 // var_1
# var_2 = var_2 // var_1
#
# print(var_1, var_2)

# 2) Напишіть програму яка буде приймати квадратне рівняння і розвязувати його.
# Памятайте що там є декілька випадків по іксам. Завдання не складне але обьємне.
# Подумайте як прийняти дані від користувача, ну і над рештою).
# # степінь
# print(2**3)
# # квадратний корінь
# print(25**0.5)
# a x 2 + bx + c = 0
#4x2−3x+1=0

a = 4
b = 3
c = 1

a * (x**2) + b * x + c




