# Візьміть дві задачі з попередніх уроків, перша легка по вирішенню(декілька стрічок),
# друга більш складна і перепишіть їх на функції. Памятайте про Атамарність та god object.
# Там де написано що користувач має щось ввести то перероблюємо на функція приймає.
# Подивіться може можна за допомогою функції спростити код. В домашку вставте будь ласка опис задачі
# (далі(один з наступних уроків) буде домашка вашу домашку покрити тестами, але ми трохи поміняємо варіанти).

# Напишіть програму яка запитує в користувача вартість покупок, він їх вводе через пробіл, точна кількість не вказана.
# Вам потрібно до вартості покупок додати 6,5 відсотки податків.
# Потім питаєте чи є в користувача купон на знижку якщо є то питаєте це на суму чи на відсоток і
# потім віднімаєте суму або відсоток відповідно від ціни яку отримали раніше і пишете користувачу кінцеву суму.
# * завдання з зірочкою не впливає на бал. Округліть суму якщо копійок більше ніж 44 то це буде + 1 гривня, якщо менше.
# то тоді просто відкидаємо копійки від ціни.
# import math
#
# price_of_products = ["23","50","11", "26", "100" ]
# new_price_of_products = []
#
# for element in price_of_prod:
#     new_number_list.append(int(element) + ((int(element) * 6.5) / 100))
# print(new_number_list)
# s_list = sum(new_number_list)
# print(s_list)
# coupon = input("Маєте купон на знижку? Введіть так,якщо маєте, або ні, якщо не маєте ")
# if coupon == "так":
#     type_coupon = input("Якщо купон на суму, введіть 0, якщо на відсоток, то введіть 1: ")
#     if type_coupon == "1":
#         sum_coupon = s_list - ((s_list * 5) / 100)
#         print(sum_coupon)
#         if sum_coupon % 1 > 0.44:
#             print(f"Сума Ваших покупок = {math.ceil(sum_coupon)}")
#         else:
#             print(f"Сума Ваших покупок = {math.floor(sum_coupon)}")
#     elif type_coupon == "0":
#         sum_coupon = s_list - 10
#         print(sum_coupon)
#         if sum_coupon % 1 > 0.44:
#             print(f"Сума Ваших покупок = {math.ceil(sum_coupon)}")
#         else:
#             print(f"Сума Ваших покупок = {math.floor(sum_coupon)}")
# else:
#     print(f"Сума Ваших покупок = {s_list}! Гарного дня!")













































    # Задача 1
    # Уявимо що до нас прийшов наш друг або подруга і попросили написати додаток для покупок в магазині
    # що б можна було скласти список продуктів та коли купуєш викреслювати(для викреслення питайте номер елемента,
    # що б видалити по індексу треба його передати в pop list_a.pop(0) - видалить нульовий індекс, памятайте що користувач не знає що в нас індекси починаються з нуля)
    # Також нам відомо що цей список має пять або більше елементів.
    # Після кожного видалення елементу виводьте наш оновлений список.
    # Після 5 видалень перевірте чи список пустий якщо не пустий напишіть що ось ще є продукти, якщо пусти то напишіть про це.
    # Також після цього кроку запропонуйте користувачу написати ще продуктів та додати його в кошик. і виведіть їх на екран. Але цього разу вже без видалень.
    # кроки:
    # Спочатку пропонуємо користувачу ввести продукти.
    # Робимо 5 запитів на видалення
    # Перевіряємо корзину
    # Пропонуємо додати продукти
    # Виводмо список і прощаємось
list_of_products = ["lemon", "banana", "juice", "candy", "chocolate"]
def del_element_of_list(del_element):
    list_of_products.pop(del_element - 1)
    print(list_of_products)

del_element = int(input("Введіть порядковий номер елемента зі списку для видалення: "))

del_element_of_list(del_element)



    # del_element = int(input("Введіть порядковий номер елемента зі списку для видалення: "))
    # list_of_products.pop(del_element - 1)
    # print(list_of_products)
    #
    # del_element = int(input("Введіть порядковий номер елемента зі списку для видалення: "))
    # list_of_products.pop(del_element - 1)
    # print(list_of_products)
    #
    # del_element = int(input("Введіть порядковий номер елемента зі списку для видалення: "))
    # list_of_products.pop(del_element - 1)
    # print(list_of_products)
    #
    # del_element = int(input("Введіть порядковий номер елемента зі списку для видалення: "))
    # list_of_products.pop(del_element - 1)
    # print(list_of_products)
    #
    # if len(list_of_products) == 0:
    #     print("Список пустий")
    # else:
    #     print("В списку лишилось ще ", list_of_products)
    #
    # # якщо додавати декілька продуктів
    # add_product = input("Введіть через пробіл продукти, які бажаєте додати: ")
    # add_prod_list = add_product.split()
    # list_of_products = list_of_products + add_prod_list
    # print(f"Ваш новий список: {list_of_products}! Гарного дня!")